dinga1981/esp8266-ai/firmware/src/main.cpp
StockRow stocks[MAX_STOCKS];
int stockCount = 0;
bool stockEverLoaded = false;
bool stockDirty = false;
bool stockChromeDrawn = false;
String stockLastCode[MAX_STOCKS]; // top line (code + CJK name strip)
String stockLastVal[MAX_STOCKS];  // value line (price + pct)
unsigned long lastStockPollMs = 0;
// CJK names come as Mac-rendered RGB565 strips (GET /stock/names.raw, one
// 156x16 strip per row) - names_rev says when to re-fetch. -1 = not drawn.
const int STOCK_NAME_W = 156, STOCK_NAME_H = 16;
int stockNamesRev = -1;
int stockNamesDrawnRev = -1;

// ---------- full-screen K-line market mode ----------
// This is a separate page from the four-row stock page above. Unlike the
// ESP32-C3 implementation, the ESP8266 does not reserve a permanent 32 KB
// frame buffer. It allocates the compressed frame only during an update,
// validates the entire envelope and CRC, draws one row at a time through the
// existing 480-byte rowBuf, then immediately releases the allocation.
const unsigned long MARKET_POLL_INTERVAL_MS = 1000;
const unsigned long MARKET_HTTP_TIMEOUT_MS = 2500;
const unsigned long MARKET_READ_TIMEOUT_MS = 1200;
const unsigned long MARKET_TOTAL_TIMEOUT_MS = 5000;
const size_t MARKET_PACKED_HEADER_BYTES = 20;
const size_t MARKET_PACKED_MAX_BYTES = 30 * 1024;
unsigned long lastMarketPollMs = 0;
uint64_t lastMarketFrameVersion = 0;
String lastMarketFrameSession;
bool marketAutoDwellKnown = false;
unsigned long marketAutoDwellMs = 0;

// ---------- date/weather mode ----------
struct WeatherState {
  String city = "SHANGHAI";
  String currentText = "WAITING";
  String todayText = "WAITING";
  String tomorrowText = "WAITING";
  float currentTemp = 0;
  float todayHigh = 0, todayLow = 0;
  float tomorrowHigh = 0, tomorrowLow = 0;
  int currentCode = 0, todayCode = 0, tomorrowCode = 0;
  long utcOffsetSeconds = 8 * 3600;
  long scheduleUtcOffsetSeconds = 8 * 3600;
  time_t serverUnix = 0;
  unsigned long syncedAtMs = 0;
  bool valid = false;
  bool stale = true;
};
WeatherState weather;
unsigned long lastWeatherPollMs = 0;
unsigned long lastWeatherClockMs = 0;
bool weatherChromeDrawn = false;
bool weatherDirty = false;

String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

int claudeFrame = 0;
int codexFrame = 0;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  int64_t weeklyResetAt = -1; // absolute Unix reset instant from the bridge
  int weeklyResetUtcOffsetSec = 0; // local offset at that instant (handles DST)
  bool needsInput = false;
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the config-portal screen is up
bool webServerStarted = false; // deferred: port 80 clashes with the portal

// ---------- backlight brightness ----------
// The panel backlight (TFT_BL, active LOW) is PWM-dimmable — the vendor's own
// firmware does the same. 0 = off, 100 = full. Persisted so it survives reboot.

int brightness = BRIGHTNESS_DEFAULT; // 0-100

void applyBrightness() {
  // analogWriteRange(100) is set in setup(), so the duty value is just the
  // inverted percentage (active LOW: 0 duty = always LOW = full on).
  analogWrite(TFT_BL, 100 - brightness);
}

void loadBrightness() {
  if (!LittleFS.exists(BRIGHTNESS_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 100) brightness = v;
}

void saveBrightness() {
  File f = LittleFS.open(BRIGHTNESS_FILE, "w");
  if (!f) return;
  f.println(brightness);
  f.close();
}

bool validAutoCycleSeconds(int seconds) {
  return seconds == 5 || seconds == 10 || seconds == 15 || seconds == 20 ||
         seconds == 30 || seconds == 60 || seconds == 120;
}

const uint8_t VISIBLE_AUTO_MASK =
    (1U << MODE_CODEX) | (1U << MODE_MUSIC) | (1U << MODE_STOCK) |
    (1U << MODE_MARKET) | (1U << MODE_WEATHER);

time_t weatherLocalEpoch() {
  if (weather.serverUnix <= 0) return 0;
  return weather.serverUnix + (time_t)((millis() - weather.syncedAtMs) / 1000UL) +
         (time_t)weather.utcOffsetSeconds;
}

bool weatherIsWeekend() {
  if (weather.serverUnix <= 0) return false;
  time_t localEpoch = weather.serverUnix +
      (time_t)((millis() - weather.syncedAtMs) / 1000UL) +
      (time_t)weather.scheduleUtcOffsetSeconds;
  if (localEpoch <= 0) return false; // before first sync, use weekday schedule
  struct tm localTm;
  gmtime_r(&localEpoch, &localTm);
  return localTm.tm_wday == 0 || localTm.tm_wday == 6;
}

uint8_t activeAutoPageMask() {
  return weatherIsWeekend() ? weekendAutoPageMask : weekdayAutoPageMask;
}

uint16_t activeAutoCycleSeconds() {
  return weatherIsWeekend() ? weekendAutoCycleSeconds : weekdayAutoCycleSeconds;
}

uint8_t selectedAutoPageCount() {
  uint8_t count = 0;
  const uint8_t mask = activeAutoPageMask();
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (mask & (1U << mode)) ++count;
  }
  return count;
}

DisplayMode autoPageAt(uint8_t selectedIndex) {
  uint8_t found = 0;
  const uint8_t mask = activeAutoPageMask();
  for (uint8_t mode = MODE_CODEX; mode <= MODE_WEATHER; ++mode) {
    if (!(mask & (1U << mode))) continue;
    if (found++ == selectedIndex) return (DisplayMode)mode;
  }
  return MODE_CODEX;
}

void loadAutoCycle() {
  if (!LittleFS.exists(AUTO_CYCLE_FILE)) return;
  File f = LittleFS.open(AUTO_CYCLE_FILE, "r");
  if (!f) return;
  const int weekdayMask = f.readStringUntil('\n').toInt();
  const int weekdaySeconds = f.readStringUntil('\n').toInt();
  String weekendMaskLine = f.readStringUntil('\n');
  String weekendSecondsLine = f.readStringUntil('\n');
  f.close();
  uint8_t cleanWeekday = (uint8_t)weekdayMask & VISIBLE_AUTO_MASK;
  if (cleanWeekday == 0) cleanWeekday = 1U << MODE_CODEX;
  weekdayAutoPageMask = cleanWeekday;
  if (validAutoCycleSeconds(weekdaySeconds)) weekdayAutoCycleSeconds = weekdaySeconds;

  // v0.5.5 stored only two lines. Duplicate that schedule for the weekend
  // when upgrading, so existing users keep the same behavior until editing it.
  if (weekendMaskLine.length() == 0) {
    weekendAutoPageMask = weekdayAutoPageMask;
    weekendAutoCycleSeconds = weekdayAutoCycleSeconds;
  } else {
    uint8_t cleanWeekend = (uint8_t)weekendMaskLine.toInt() & VISIBLE_AUTO_MASK;
    if (cleanWeekend == 0) cleanWeekend = 1U << MODE_CODEX;
    weekendAutoPageMask = cleanWeekend;
    const int weekendSeconds = weekendSecondsLine.toInt();
    if (validAutoCycleSeconds(weekendSeconds)) weekendAutoCycleSeconds = weekendSeconds;
  }
}

void saveAutoCycle() {
  File f = LittleFS.open(AUTO_CYCLE_FILE, "w");
  if (!f) return;
  f.println(weekdayAutoPageMask);
  f.println(weekdayAutoCycleSeconds);
  f.println(weekendAutoPageMask);
  f.println(weekendAutoCycleSeconds);
  f.close();
}

void resetAutoCyclePosition() {
  autoPageIndex = 0;
  autoPageStartedMs = millis();
  lastAutoScheduleWeekend = weatherIsWeekend();
}

void advanceAutoCycleIfNeeded(unsigned long nowMs) {
  if (displayMode != MODE_AUTO) return;
  const bool weekend = weatherIsWeekend();
  if (weekend != lastAutoScheduleWeekend) {
    lastAutoScheduleWeekend = weekend;
    autoPageIndex = 0;
    autoPageStartedMs = nowMs;
    lastEffectiveMode = MODE_AUTO;
  }
  const uint8_t count = selectedAutoPageCount();
  if (count == 0) return;
  unsigned long dwellMs = (unsigned long)activeAutoCycleSeconds() * 1000UL;
  if (autoPageAt(autoPageIndex) == MODE_MARKET) {
    // Give the bridge a short grace period to report its favorite count and
    // K-line rotation cadence. Once known, keep this page for one complete
    // favorite round instead of cutting it off at the outer page interval.
    if (!marketAutoDwellKnown && nowMs - autoPageStartedMs < 3000UL) return;
    if (marketAutoDwellKnown && marketAutoDwellMs > dwellMs) dwellMs = marketAutoDwellMs;
  }
  if (nowMs - autoPageStartedMs >= dwellMs) {
    autoPageIndex = (autoPageIndex + 1) % count;
    autoPageStartedMs = nowMs;
  }
}

// ---------- persistence for the bridge host ----------

void loadBridgeHost() {
  if (LittleFS.exists(WIFI_CONFIG_FILE)) {
    File f = LittleFS.open(WIFI_CONFIG_FILE, "r");
    bridgeHost = f.readStringUntil('\n');
    bridgeHost.trim();
    f.close();
  }
}

void saveBridgeHost(const String &host) {
  File f = LittleFS.open(WIFI_CONFIG_FILE, "w");
  f.println(host);
  f.close();
}

// ---------- custom sprite loading ----------

// Checks LittleFS for a previously-uploaded custom sprite and validates its
// size before trusting it (frame count byte + exact expected byte length).
void loadCustomSpriteState() {
  claudeCustom = false;
  if (LittleFS.exists(CLAUDE_SPRITE_FILE)) {
    File f = LittleFS.open(CLAUDE_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CLAUDE_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        claudeCustom = true;
        claudeCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

