dinga1981/esp8266-ai/firmware/src/main.cpp
void drawSqText(const String &s, int x, int y, int pitch, int d, uint16_t color) {
  for (unsigned int i = 0; i < s.length(); i++) {
    const DotGlyph *g = dotGlyph(s[i]);
    if (g)
      for (int ry = 0; ry < 7; ry++)
        for (int cx = 0; cx < g->w; cx++)
          if (g->rows[ry] & (1 << (g->w - 1 - cx)))
            tft.fillRect(x + cx * pitch, y + ry * pitch, d, d, color);
    x += sqCharAdv(s[i], pitch, d);
  }
}

void drawSqTextC(const String &s, int cx, int y, int pitch, int d, uint16_t color) {
  drawSqText(s, cx - sqTextWidth(s, pitch, d) / 2, y, pitch, d, color);
}

struct TinyGlyph {
  char c;
  uint8_t rows[5];
};

const TinyGlyph tinyGlyphs[] = {
    {'R', {0b110, 0b101, 0b110, 0b101, 0b101}},
    {'E', {0b111, 0b100, 0b110, 0b100, 0b111}},
    {'S', {0b011, 0b100, 0b010, 0b001, 0b110}},
    {'T', {0b111, 0b010, 0b010, 0b010, 0b010}},
};

void drawTinyBoldText(const String &s, int cx, int y, uint16_t color) {
  const int P = 2, D = 2;
  int x = cx - ((int)s.length() * (2 * P + D) + ((int)s.length() - 1) * 2) / 2;
  for (unsigned int i = 0; i < s.length(); i++) {
    for (const TinyGlyph &g : tinyGlyphs)
      if (g.c == s[i]) {
        for (int ry = 0; ry < 5; ry++)
          for (int gx = 0; gx < 3; gx++)
            if (g.rows[ry] & (0b100 >> gx)) tft.fillRect(x + gx * P, y + ry * P, D, D, color);
        break;
      }
    x += 2 * P + D + 2;
  }
}

void drawQuotaText(float hourPct, float weekPct, bool force) {
  // Codex dropped the 5h window (2026-07): the bridge then sends
  // primary_pct=null, so collapse to a single centered "Wk" column.
  bool single = hourPct < 0 && weekPct >= 0;
  static int8_t lastSingle = -1;
  if ((int8_t)single != lastSingle) {
    lastSingle = (int8_t)single;
    force = true;
    tft.fillRect(0, QUOTA_LABEL_Y, 240, QUOTA_VALUE_Y + 22 - QUOTA_LABEL_Y, TFT_BLACK);
  }
  if (single) {
    if (force) drawSqTextC("Wk", 120, QUOTA_LABEL_Y, 2, 2, TFT_LIGHTGREY);
    String v = pctText(weekPct);
    if (force || v != lastQuotaWk) {
      lastQuotaWk = v;
      lastQuota5h = "";
      tft.fillRect(120 - 50, QUOTA_VALUE_Y, 100, 22, TFT_BLACK);
      drawDotTextC(v, 120, QUOTA_VALUE_Y, 3, 1, TFT_WHITE);
    }
    return;
  }
  if (force) {
    drawSqTextC("5h", QUOTA_COL1_X, QUOTA_LABEL_Y, 2, 2, TFT_LIGHTGREY);
    drawSqTextC("Wk", QUOTA_COL2_X, QUOTA_LABEL_Y, 2, 2, TFT_LIGHTGREY);
  }
  String v1 = pctText(hourPct), v2 = pctText(weekPct);
  if (force || v1 != lastQuota5h) {
    lastQuota5h = v1;
    tft.fillRect(QUOTA_COL1_X - 50, QUOTA_VALUE_Y, 100, 22, TFT_BLACK);
    drawDotTextC(v1, QUOTA_COL1_X, QUOTA_VALUE_Y, 3, 1, TFT_WHITE);
  }
  if (force || v2 != lastQuotaWk) {
    lastQuotaWk = v2;
    tft.fillRect(QUOTA_COL2_X - 50, QUOTA_VALUE_Y, 100, 22, TFT_BLACK);
    drawDotTextC(v2, QUOTA_COL2_X, QUOTA_VALUE_Y, 3, 1, TFT_WHITE);
  }
}

// ---------- quota-exhausted countdown ----------
// When the current app's 5h or weekly window is used up, the pet is replaced
// by a countdown to that window's reset (bridge sends minutes-until-reset).
// A spent weekly window blocks usage even after the 5h one resets, so the
// weekly countdown takes priority when both are exhausted.

enum CdType { CD_NONE, CD_5H, CD_WEEK };

float currentHourPct() {
  return currentApp == APP_CLAUDE ? claudeStatus.fiveHourPct : codexStatus.primaryPct;
}

int currentHourResetMin() {
  return currentApp == APP_CLAUDE ? claudeStatus.fiveHourResetMin : codexStatus.primaryResetMin;
}

float currentWeekPct() {
  return currentApp == APP_CLAUDE ? claudeStatus.sevenDayPct : codexStatus.weeklyPct;
}

int currentWeekResetMin() {
  return currentApp == APP_CLAUDE ? claudeStatus.sevenDayResetMin : codexStatus.weeklyResetMin;
}

CdType desiredCountdown() {
  if (currentWeekPct() >= 99.9f && currentWeekResetMin() >= 0) return CD_WEEK;
  if (currentHourPct() >= 99.9f && currentHourResetMin() >= 0) return CD_5H;
  return CD_NONE;
}

CdType showingCd = CD_NONE; // what's on screen now (vs desiredCountdown())
String lastCountdown;

// The bridge only reports whole minutes, so the seconds tick locally against
// a deadline anchored at millis(). Re-anchor only when the bridge disagrees
// by more than ~a minute (new window, big clock drift), otherwise a poll
// landing mid-minute would make the seconds jump around.
unsigned long cdDeadlineMs = 0; // 0 = not anchored
ActiveApp cdApp = APP_CLAUDE;   // which app/window the anchor belongs to
CdType cdAnchorType = CD_NONE;

void syncCountdownDeadline() {
  int m = showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin();
  if (m < 0) {
    cdDeadlineMs = 0;
    return;
  }
  long bridgeSec = (long)m * 60 + 30; // bridge floors to minutes: assume mid-minute
  long ourSec = (long)(cdDeadlineMs - millis()) / 1000;
  if (cdDeadlineMs == 0 || cdApp != currentApp || cdAnchorType != showingCd || ourSec < 0 ||
      labs(ourSec - bridgeSec) > 90) {
    cdDeadlineMs = millis() + (unsigned long)bridgeSec * 1000UL;
    cdApp = currentApp;
    cdAnchorType = showingCd;
  }
}

void drawCountdown(bool force) {
  long remain = cdDeadlineMs ? (long)(cdDeadlineMs - millis()) / 1000
                             : (long)(showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin()) * 60;
  if (remain < 0) remain = 0;
  char buf[16];
  long hours = remain / 3600;
  if (hours >= 100) // weekly can be up to 168h: h:mm:ss wouldn't fit the ring
    snprintf(buf, sizeof(buf), "%ld:%02ld", hours, (remain % 3600) / 60);
  else
    snprintf(buf, sizeof(buf), "%ld:%02ld:%02ld", hours, (remain % 3600) / 60, remain % 60);
  String t(buf);
  if (!force && t == lastCountdown) return;
  // A length change shifts every glyph cell, so clear the whole region.
  if (t.length() != lastCountdown.length()) force = true;
  const int P = 6, R = 2, VAL_Y = 100;
  int x = SCREEN_CX - dotTextWidth(t, P, R) / 2;
  if (force) {
    tft.fillRect(SCREEN_CX - 99, 66, 198, 84, TFT_BLACK);
    drawDotTextC(showingCd == CD_WEEK ? "Wk RESET IN" : "5h RESET IN", SCREEN_CX, 72, 2, 0,
                 TFT_LIGHTGREY);
    drawDotText(t, x, VAL_Y, P, R, TFT_ORANGE);
  } else {
    // Same length keeps identical cell positions, so repaint only digits that
    // changed and avoid a once-per-second full-row flash.
    for (unsigned int i = 0; i < t.length(); i++) {
      int adv = dotCharAdv(t[i], P, R);
      if (t[i] != lastCountdown[i]) {
        tft.fillRect(x, VAL_Y, adv - P, dotTextHeight(P, R), TFT_BLACK);
        drawDotChar(t[i], x, VAL_Y, P, R, TFT_ORANGE);
      }
      x += adv;
    }
  }
  lastCountdown = t;
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, same as the sprite path.
const int LOGO_X = 14, LOGO_Y = 18;

void drawAppLogo() {
  const uint16_t *logo = (currentApp == APP_CLAUDE) ? claude_logo_0 : codex_logo_0;
  int w = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_W : CODEX_LOGO_W;
  int h = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_H : CODEX_LOGO_H;
  for (int r = 0; r < h; r++) {
    memcpy_P(rowBuf, logo + (size_t)r * w, (size_t)w * 2);
    tft.pushImage(LOGO_X, LOGO_Y + r, w, 1, rowBuf);
  }
}

// Days until the weekly quota resets, shown opposite the app logo. Below one
// day the readout changes to hours.
const int RESET_CX = 198, RESET_LABEL_Y = 18, RESET_VALUE_Y = 33;
String lastResetDays;
String lastExactResetTime;

String resetDaysText(int min) {
  if (min < 0) return "";
  if (min < 1440) return String((min + 59) / 60) + "h";
  return String((min + 1439) / 1440) + "d";
}

void drawResetDays(bool force) {
  String t = resetDaysText(currentWeekResetMin());
  if (!force && t == lastResetDays) return;
  lastResetDays = t;
  tft.fillRect(RESET_CX - 32, RESET_LABEL_Y, 60, RESET_VALUE_Y + 27 - RESET_LABEL_Y, TFT_BLACK);
  if (t.length() == 0) return;
  drawTinyBoldText("RESET", RESET_CX, RESET_LABEL_Y, TFT_LIGHTGREY);
  int pitch = t.length() <= 2 ? 4 : 3;
  drawDotTextC(t, RESET_CX, RESET_VALUE_Y, pitch, 1, TFT_WHITE);
}

// Exact Codex weekly reset time in the bridge Mac's local timezone. The
// bridge sends both the absolute Unix instant and the UTC offset that applies
// at that future instant, so this remains correct across daylight-saving
// transitions and does not depend on the weather page having synchronised.
void drawExactResetTime(bool force) {
  if (currentApp != APP_CODEX) return;
  String dateText, timeText;
  if (codexStatus.weeklyResetAt > 0) {
    time_t localReset = (time_t)(codexStatus.weeklyResetAt +
                                 codexStatus.weeklyResetUtcOffsetSec);
    struct tm resetTm;
    gmtime_r(&localReset, &resetTm);
    char dateBuf[32], timeBuf[32];
    snprintf(dateBuf, sizeof(dateBuf), "%02d/%02d", resetTm.tm_mon + 1, resetTm.tm_mday);
    snprintf(timeBuf, sizeof(timeBuf), "%02d:%02d", resetTm.tm_hour, resetTm.tm_min);
    dateText = dateBuf;
    timeText = timeBuf;
  }
  const String key = dateText + "|" + timeText;
  if (!force && key == lastExactResetTime) return;
  lastExactResetTime = key;
  tft.fillRect(75, 18, 81, 31, TFT_BLACK);
  if (dateText.length() == 0) return;
  drawSqTextC(dateText, 116, 18, 2, 1, TFT_LIGHTGREY);
  drawDotTextC(timeText, 116, 33, 2, 1, TFT_WHITE);
}

// Codex's ring percentage: the 5h window when it exists, otherwise the
// weekly one (Codex removed the 5h limit in 2026-07).
float codexRingPct() {
  if (codexStatus.primaryPct >= 0) return codexStatus.primaryPct;
  return max(codexStatus.weeklyPct, 0.0f);
}

// Claude's ring percentage: real 5h OAuth quota from the bridge when known,
// otherwise fall back to elapsed session time as a rough stand-in.
float claudeRingPct() {
  if (claudeStatus.fiveHourPct >= 0) return claudeStatus.fiveHourPct;
  return claudeStatus.sessionWindowMin > 0
             ? (100.0 * claudeStatus.sessionMin / claudeStatus.sessionWindowMin)
             : 0;
}

// Redraws whichever app is currently active, full screen: quota ring +
// sprite (or the reset countdown while the 5h window is exhausted).
// Full clear + repaint - only for real transitions (app switch, mode return,
// sprite change); steady-state data updates go through refreshActiveApp().
void drawActiveApp() {
  tft.fillScreen(TFT_BLACK);
  ringLastPct = -1000; // screen was cleared: force the ring repaint
  showingCd = desiredCountdown();
  if (showingCd != CD_NONE) syncCountdownDeadline();
  else cdDeadlineMs = 0;
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
    if (showingCd == CD_NONE) drawClaudeSprite(claudeFrame);
    drawQuotaText(claudeRingPct(), claudeStatus.sevenDayPct, true);
  } else {
    drawSquareRing(codexRingPct(), currentStatusColor());
    if (showingCd == CD_NONE) drawCodexSprite(codexFrame);
    drawQuotaText(codexStatus.primaryPct, codexStatus.weeklyPct, true);
  }
  if (showingCd != CD_NONE) drawCountdown(true);
  drawAppLogo();
  drawExactResetTime(true);
  drawResetDays(true);
}

// In-place refresh after a bridge poll: ring repaint + only the text that
// actually changed. No fillScreen, so the 5s poll doesn't blank the screen.
void refreshActiveApp() {
  if (desiredCountdown() != showingCd) { // pet <-> countdown (or 5h <-> weekly) swap
    drawActiveApp();
    return;
  }
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
    drawQuotaText(claudeRingPct(), claudeStatus.sevenDayPct, false);
  } else {
    drawSquareRing(codexRingPct(), currentStatusColor());
    drawQuotaText(codexStatus.primaryPct, codexStatus.weeklyPct, false);
  }
  drawExactResetTime(false);
  drawResetDays(false);
  if (showingCd != CD_NONE) {
    syncCountdownDeadline();
    drawCountdown(false);
  }
}

// Redraws just the ring (cheap) - used for status color animation ticks
// between full redraws.
void redrawRingOnly() {
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
  } else {
    drawSquareRing(codexRingPct(), currentStatusColor());
  }
}

// Who gets the screen:
//   - display mode pinned (Mac app) -> that app, always
//   - exactly one app working       -> that app, immediately
//   - both working                  -> alternate every SWITCH_BOTH_MS (2s)
//   - neither working               -> alternate slowly (SWITCH_IDLE_MS)
bool updateActiveApp() {
  ActiveApp desired = currentApp;

  if (displayMode == MODE_CLAUDE) {
    desired = APP_CLAUDE;
  } else if (displayMode == MODE_CODEX) {
    desired = APP_CODEX;
  } else if (claudeStatus.needsInput && !codexStatus.needsInput) {
    desired = APP_CLAUDE; // approval prompt wins the screen
  } else if (codexStatus.needsInput && !claudeStatus.needsInput) {
    desired = APP_CODEX;
  } else {
    bool claudeWorking = claudeStatus.status == "working";
    bool codexWorking = codexStatus.status == "working";
    if (claudeWorking && !codexWorking) {
      desired = APP_CLAUDE;
    } else if (codexWorking && !claudeWorking) {
      desired = APP_CODEX;
    } else {
      unsigned long interval = (claudeWorking && codexWorking) ? SWITCH_BOTH_MS : SWITCH_IDLE_MS;
      if (millis() - lastSwitchMs >= interval) {
        lastSwitchMs = millis();
        desired = (currentApp == APP_CLAUDE) ? APP_CODEX : APP_CLAUDE;
      }
    }
  }

