dinga1981/esp8266-ai/firmware/src/main.cpp
  const uint16_t footer = tft.color565(9, 19, 29);
  const uint16_t muted = tft.color565(151, 172, 188);
  const uint16_t warm = tft.color565(255, 180, 95);
  const uint16_t cool = tft.color565(119, 207, 255);
  tft.fillRect(1, 169, 118, 70, footer);
  tft.fillRect(121, 169, 119, 70, footer);
  for (int day = 0; day < 2; ++day) {
    const int x = day * 120;
    const int code = day == 0 ? weather.todayCode : weather.tomorrowCode;
    const String label = day == 0 ? "TODAY" : "TMRW";
    const String condition = day == 0 ? weather.todayText : weather.tomorrowText;
    const float high = day == 0 ? weather.todayHigh : weather.tomorrowHigh;
    const float low = day == 0 ? weather.todayLow : weather.tomorrowLow;
    drawWeatherIcon(x + 27, 203, 31, code);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(muted, footer);
    tft.drawString(label, x + 49, 180, 1);
    tft.drawString(condition.substring(0, 8), x + 49, 191, 1);
    tft.setTextColor(warm, footer);
    tft.drawString(weather.valid ? String((int)round(high)) : "--", x + 49, 207, 2);
    tft.setTextColor(TFT_LIGHTGREY, footer);
    tft.drawString("/", x + 76, 207, 2);
    tft.setTextColor(cool, footer);
    tft.drawString(weather.valid ? String((int)round(low)) : "--", x + 87, 207, 2);
  }
}

// ---------- full-screen K-line frame ----------

bool readMarketExact(WiFiClient *stream, uint8_t *dst, size_t length,
                     unsigned long timeoutMs) {
  size_t received = 0;
  unsigned long deadline = millis() + timeoutMs;
  while (received < length) {
    int available = stream->available();
    if (available > 0) {
      size_t want = min((size_t)available, length - received);
      int got = stream->read(dst + received, want);
      if (got > 0) {
        received += (size_t)got;
        continue;
      }
    }
    if ((long)(millis() - deadline) >= 0) return false;
    delay(1);
    yield();
  }
  return true;
}

uint32_t marketCrc32(const uint8_t *data, size_t length) {
  uint32_t crc = 0xFFFFFFFF;
  for (size_t i = 0; i < length; ++i) {
    crc ^= data[i];
    for (int bit = 0; bit < 8; ++bit) {
      crc = (crc >> 1) ^ ((crc & 1U) ? 0xEDB88320U : 0U);
    }
  }
  return ~crc;
}

uint64_t marketReadU64BE(const uint8_t *data) {
  uint64_t value = 0;
  for (int i = 0; i < 8; ++i) value = (value << 8) | data[i];
  return value;
}

uint32_t marketReadU32BE(const uint8_t *data) {
  return ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
         ((uint32_t)data[2] << 8) | data[3];
}

// Validate every byte and the decoded pixel count before the TFT is touched.
// A short/corrupt/oversized download therefore leaves the prior page intact.
bool validateMarketFrame(const uint8_t *frame, size_t frameBytes,
                         uint64_t expectedVersion, uint64_t &versionOut) {
  if (frameBytes < MARKET_PACKED_HEADER_BYTES || memcmp(frame, "MKT1", 4) != 0) return false;
  const uint16_t width = ((uint16_t)frame[12] << 8) | frame[13];
  const uint16_t height = ((uint16_t)frame[14] << 8) | frame[15];
  if (width != SCREEN_W || height != SCREEN_H) return false;
  const uint64_t version = marketReadU64BE(frame + 4);
  if (version < expectedVersion || version <= lastMarketFrameVersion) return false;
  const uint8_t *payload = frame + MARKET_PACKED_HEADER_BYTES;
  const size_t payloadBytes = frameBytes - MARKET_PACKED_HEADER_BYTES;
  if (marketCrc32(payload, payloadBytes) != marketReadU32BE(frame + 16)) return false;

  size_t cursor = 0, pixels = 0;
  while (cursor < payloadBytes) {
    const uint8_t control = payload[cursor++];
    const size_t count = (control & 0x7F) + 1;
    const size_t encoded = (control & 0x80) ? 2 : count * 2;
    if (cursor + encoded > payloadBytes || pixels + count > SCREEN_W * SCREEN_H) return false;
    cursor += encoded;
    pixels += count;
  }
  if (pixels != SCREEN_W * SCREEN_H) return false;
  versionOut = version;
  return true;
}

void drawMarketFrame(const uint8_t *frame, size_t frameBytes) {
  const uint8_t *payload = frame + MARKET_PACKED_HEADER_BYTES;
  const size_t payloadBytes = frameBytes - MARKET_PACKED_HEADER_BYTES;
  uint8_t *rowBytes = reinterpret_cast<uint8_t *>(rowBuf);
  size_t cursor = 0, rowPixels = 0;
  int y = 0;
  tft.startWrite();
  while (cursor < payloadBytes) {
    const uint8_t control = payload[cursor++];
    size_t count = (control & 0x7F) + 1;
    const bool repeated = control & 0x80;
    uint8_t high = 0, low = 0;
    if (repeated) { high = payload[cursor++]; low = payload[cursor++]; }
    while (count-- > 0) {
      rowBytes[rowPixels * 2] = repeated ? high : payload[cursor++];
      rowBytes[rowPixels * 2 + 1] = repeated ? low : payload[cursor++];
      if (++rowPixels == SCREEN_W) {
        tft.pushImage(0, y++, SCREEN_W, 1, rowBuf);
        rowPixels = 0;
        yield();
      }
    }
  }
  tft.endWrite();
}

bool fetchMarketFrame(uint64_t expectedVersion, size_t advertisedBytes) {
  if (advertisedBytes < MARKET_PACKED_HEADER_BYTES ||
      advertisedBytes > MARKET_PACKED_MAX_BYTES) return false;
  // Leave enough contiguous heap for HTTP/TCP and the rest of the firmware.
  if (ESP.getMaxFreeBlockSize() < advertisedBytes + 6144) {
    Serial.printf("[market] insufficient heap frame=%u maxblock=%u\n",
                  (unsigned)advertisedBytes, ESP.getMaxFreeBlockSize());
    return false;
  }
  uint8_t *frame = (uint8_t *)malloc(advertisedBytes);
  if (!frame) return false;

  WiFiClient client;
  client.setTimeout(MARKET_READ_TIMEOUT_MS);
  HTTPClient http;
  String url = "http://" + bridgeHost + "/market/frame.rle";
  http.setTimeout(MARKET_HTTP_TIMEOUT_MS);
  bool ok = false;
  if (http.begin(client, url)) {
    const int code = http.GET();
    const int actualBytes = http.getSize();
    if (code == HTTP_CODE_OK && actualBytes == (int)advertisedBytes) {
      WiFiClient *stream = http.getStreamPtr();
      if (readMarketExact(stream, frame, advertisedBytes, MARKET_TOTAL_TIMEOUT_MS)) {
        uint64_t version = 0;
        if (validateMarketFrame(frame, advertisedBytes, expectedVersion, version)) {
          drawMarketFrame(frame, advertisedBytes);
          lastMarketFrameVersion = version;
          ok = true;
          Serial.printf("[market] applied version=%llu bytes=%u heap=%u\n",
                        (unsigned long long)version, (unsigned)advertisedBytes,
                        ESP.getFreeHeap());
        }
      }
    }
    http.end();
  }
  free(frame);
  if (!ok) Serial.println("[market] frame rejected; keeping previous screen");
  return ok;
}

